# Дан список lst = [11, 5, 0, 32, 15, 3, 20, 132, 21, 4, 556, 9, 20].
# Необходимо вывести элементы6 которые одновременно:
# 1) меньше 30 и 2) делится на 3 без остатка.
# Остальные элементыпронумеровать и вывести конечный результат.
lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
median = 30
div_num = 3
sm = 0
for item in lst:
    if (item < median) and (item % div_num == 0):
        print(item)
    else:
        sm += item
print("Сумма:", sm)